In [1]:
# standard ds imports
import numpy as np
import pandas as pd

# for wrangling and exploration
# import wrangle

# for visualization
import matplotlib.pyplot as plt
import seaborn as sns
sns.set()

# for statistical analysis
import scipy.stats as stats

import env
import os

#### 1. Acquire bedroomcnt, bathroomcnt, calculatedfinishedsquarefeet, taxvaluedollarcnt, yearbuilt, taxamount, and fips from the zillow database for all 'Single Family Residential' properties.

In [10]:
query1 = '''
SELECT bedroomcnt, 
		bathroomcnt, 
        calculatedfinishedsquarefeet,
        taxvaluedollarcnt,
        yearbuilt,
        taxamount,
        fips
 FROM properties_2016
 WHERE propertylandusetypeid = 261
 ;
'''

In [11]:
df_2016 = pd.read_sql(query1, env.conn('zillow'))

In [12]:
query2 = '''
SELECT bedroomcnt, 
		bathroomcnt, 
        calculatedfinishedsquarefeet,
        taxvaluedollarcnt,
        yearbuilt,
        taxamount,
        fips
 FROM properties_2017
 WHERE propertylandusetypeid = 261
 ;
'''

In [13]:
df_2017 = pd.read_sql(query2, env.conn('zillow'))

In [20]:
zil = pd.concat([df_2016, df_2017])

In [21]:
zil.head()

,bedroomcnt,bathroomcnt,calculatedfinishedsquarefeet,taxvaluedollarcnt,yearbuilt,taxamount,fips
0,4.0,3.0,2090.0,615000.0,1973.0,8625.75,6037.0
1,5.0,3.0,2479.0,531642.0,1973.0,6722.67,6037.0
2,4.0,2.0,2057.0,328148.0,1973.0,4160.63,6037.0
3,4.0,3.0,2423.0,297377.0,1978.0,3883.47,6037.0
4,4.0,3.0,2226.0,297001.0,1978.0,3884.27,6037.0

In [22]:
zil.shape

(4301225, 7)

In [23]:
zil.to_csv('zillow.csv')

#### 2. Using your acquired Zillow data, walk through the summarization and cleaning steps in your wrangle.ipynb file like we did above. You may handle the missing values however you feel is appropriate and meaningful; remember to document your process and decisions using markdown and code commenting where helpful.

In [29]:
zil.head(10)

,bedroomcnt,bathroomcnt,calculatedfinishedsquarefeet,taxvaluedollarcnt,yearbuilt,taxamount,fips
0,4.0,3.0,2090.0,615000.0,1973.0,8625.75,6037.0
1,5.0,3.0,2479.0,531642.0,1973.0,6722.67,6037.0
2,4.0,2.0,2057.0,328148.0,1973.0,4160.63,6037.0
3,4.0,3.0,2423.0,297377.0,1978.0,3883.47,6037.0
4,4.0,3.0,2226.0,297001.0,1978.0,3884.27,6037.0
5,4.0,3.0,2423.0,283450.0,1978.0,3682.27,6037.0
6,4.0,3.0,2423.0,250627.0,1978.0,3314.68,6037.0
7,4.0,3.0,2226.0,617563.0,1978.0,7751.63,6037.0
8,4.0,2.0,2351.0,438213.0,1978.0,5558.31,6037.0
9,4.0,3.0,2423.0,503737.0,1978.0,6334.74,6037.0

In [24]:
zil.describe().T

,count,mean,std,min,25%,50%,75%,max
bedroomcnt,4301203.0,3.284969,0.955380,0.00,3.0,3.00,4.00,25.00
bathroomcnt,4301203.0,2.227108,0.996929,0.00,2.0,2.00,3.00,32.00
calculatedfinishedsquarefeet,4282910.0,1860.625670,1219.707339,1.00,1256.0,1621.00,2205.00,952576.00
taxvaluedollarcnt,4300244.0,449924.495659,677143.849102,1.00,183723.0,319799.00,520948.25,98428909.00
yearbuilt,4281235.0,1960.874463,22.083149,1801.00,1949.0,1958.00,1975.00,2016.00
taxamount,4292387.0,5618.443766,8128.884499,1.34,2531.0,4100.37,6396.96,1337755.86
fips,4301225.0,6048.368292,20.427696,6037.00,6037.0,6037.00,6059.00,6111.00

In [26]:
zil.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4301225 entries, 0 to 2152862
Data columns (total 7 columns):
 #   Column                        Dtype
---  ------                        -----
 0   bedroomcnt                    float64
 1   bathroomcnt                   float64
 2   calculatedfinishedsquarefeet  float64
 3   taxvaluedollarcnt             float64
 4   yearbuilt                     float64
 5   taxamount                     float64
 6   fips                          float64
dtypes: float64(7)
memory usage: 262.5 MB

In [2]:
zil = pd.read_csv('zillow.csv').iloc[:,1:]

In [3]:
zil.head()

,bedroomcnt,bathroomcnt,calculatedfinishedsquarefeet,taxvaluedollarcnt,yearbuilt,taxamount,fips
0,4.0,3.0,2090.0,615000.0,1973.0,8625.75,6037.0
1,5.0,3.0,2479.0,531642.0,1973.0,6722.67,6037.0
2,4.0,2.0,2057.0,328148.0,1973.0,4160.63,6037.0
3,4.0,3.0,2423.0,297377.0,1978.0,3883.47,6037.0
4,4.0,3.0,2226.0,297001.0,1978.0,3884.27,6037.0

In [4]:
zil = zil.dropna(how='any')

In [5]:
zil.isnull().sum()

bedroomcnt                      0
bathroomcnt                     0
calculatedfinishedsquarefeet    0
taxvaluedollarcnt               0
yearbuilt                       0
taxamount                       0
fips                            0
dtype: int64

In [6]:
zil.fips.value_counts(ascending=True)

6111.0     325354
6059.0    1100896
6037.0    2848344
Name: fips, dtype: int64

In [7]:
zil.bedroomcnt = zil.bedroomcnt.astype('int64')
zil.calculatedfinishedsquarefeet = zil.calculatedfinishedsquarefeet.astype('int64')
zil.taxvaluedollarcnt = zil.taxvaluedollarcnt.astype('int64')
zil.yearbuilt = zil.yearbuilt.astype('int64')
zil.fips = zil.fips.astype('int64')

In [8]:
zil.head()

,bedroomcnt,bathroomcnt,calculatedfinishedsquarefeet,taxvaluedollarcnt,yearbuilt,taxamount,fips
0,4,3.0,2090,615000,1973,8625.75,6037
1,5,3.0,2479,531642,1973,6722.67,6037
2,4,2.0,2057,328148,1973,4160.63,6037
3,4,3.0,2423,297377,1978,3883.47,6037
4,4,3.0,2226,297001,1978,3884.27,6037

#### 3. Store all of the necessary functions to automate your process from acquiring the data to returning a cleaned dataframe with no missing values in your wrangle.py file. Name your final function wrangle_zillow.

In [19]:
def wrangle_zillow():
    '''
    This function checks if the zillow data is saved locally. 
    If it is not local, this function reads the zillow data from 
    the CodeUp MySQL database and return it in a DataFrame.
    '''
    
    # Acquire
    filename = 'zillow.csv'
    if os.path.isfile(filename):
        df = pd.read_csv(filename).iloc[:,1:]
    else:
        q1 = '''SELECT bedroomcnt, 
                    bathroomcnt, 
                    calculatedfinishedsquarefeet,
                    taxvaluedollarcnt,
                    yearbuilt,
                    taxamount,
                    fips
                 FROM properties_2016
                 WHERE propertylandusetypeid = 261
             ;'''
        q2 = '''SELECT bedroomcnt, 
                    bathroomcnt, 
                    calculatedfinishedsquarefeet,
                    taxvaluedollarcnt,
                    yearbuilt,
                    taxamount,
                    fips
                 FROM properties_2017
                 WHERE propertylandusetypeid = 261
             ;'''
        df1 = pd.read_sql(q1, conn('zillow'))
        df2 = pd.read_sql(q2, conn('zillow'))
        df = pd.concat([df1,df2])

        df.to_csv(filename)
        
        
    # Prepare
    df = df.dropna(how='any')
    df.bedroomcnt = df.bedroomcnt.astype('int64')
    df.calculatedfinishedsquarefeet = df.calculatedfinishedsquarefeet.astype('int64')
    df.taxvaluedollarcnt = df.taxvaluedollarcnt.astype('int64')
    df.yearbuilt = df.yearbuilt.astype('int64')
    df.fips = df.fips.astype('int64')
    
    df.columns = ['beds', 'baths', 'sqft', 'price', 'built', 'taxes', 'location']
    
    return df

In [20]:
test = wrangle_zillow()

In [21]:
test.head()

   beds  baths  sqft   price  built    taxes  location
0     4    3.0  2090  615000   1973  8625.75      6037
1     5    3.0  2479  531642   1973  6722.67      6037
2     4    2.0  2057  328148   1973  4160.63      6037
3     4    3.0  2423  297377   1978  3883.47      6037
4     4    3.0  2226  297001   1978  3884.27      6037

In [22]:
test.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4274594 entries, 0 to 4301224
Data columns (total 7 columns):
 #   Column    Dtype
---  ------    -----
 0   beds      int64
 1   baths     float64
 2   sqft      int64
 3   price     int64
 4   built     int64
 5   taxes     float64
 6   location  int64
dtypes: float64(2), int64(5)
memory usage: 260.9 MB

In [2]:
# Test it out
import wrangle

In [3]:
df = wrangle.wrangle_zillow()

In [4]:
df.isnull().sum()

beds        0
baths       0
sqft        0
price       0
built       0
taxes       0
location    0
dtype: int64

In [5]:
df.head()

   beds  baths  sqft   price  built    taxes  location
0     4    3.0  2090  615000   1973  8625.75      6037
1     5    3.0  2479  531642   1973  6722.67      6037
2     4    2.0  2057  328148   1973  4160.63      6037
3     4    3.0  2423  297377   1978  3883.47      6037
4     4    3.0  2226  297001   1978  3884.27      6037

In [6]:
df.info(show_counts=True)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4274594 entries, 0 to 4301224
Data columns (total 7 columns):
 #   Column    Non-Null Count    Dtype
---  ------    --------------    -----
 0   beds      4274594 non-null  int64
 1   baths     4274594 non-null  float64
 2   sqft      4274594 non-null  int64
 3   price     4274594 non-null  int64
 4   built     4274594 non-null  int64
 5   taxes     4274594 non-null  float64
 6   location  4274594 non-null  int64
dtypes: float64(2), int64(5)
memory usage: 260.9 MB